Merge pull request #2 from gustcol/first
update
